# Criando banco de dados

Para criar um banco de dados, o comando é:

CREATE DATABASE <nome>
Onde consgeuimos criar tabelas e inserir dados

Os comandos são sempre maiusculos, já os nomes são minusculos, tipo: (banco, tabela, coluna), por exemplo:
CREATE DATABASE teste;
usar sempre ";' no fim

criar uma tabela:
CREATE TABLE nome(nome da coluna TIPO(quantidade de caracteres));
Deletar
DROP nome;
eXEMPLO: CREATE TABLE produtos(nome VARCHAR(50), sku CHAR(5), informacoes MEDIUMTEXT);

# Tipos de dados de texto

CHAR(x) aceita textos de 0 a 255 carcteres;
VARCHAR(X) é o mais usado, aceita de 0 a 65535;
TINYTEXT apenas até 255
MEDIUMTEXT apenas textos até 16777215
CHAR E VARCHAR aceitam números e caracteres especiais

# Inserir dados

INSERT INTO tabela (colunas) VALUES (valores)
Exemplo: INSERT INTO produtos (nome, sku, informacoes) VALUES ("Playstation 5", "PS5XY", "é um vedeogame de última geração");

# Tipos de dados de números

BIT(X) 1 a 64 caracteres
TINYINT(X) 1 a 255 caracteres
BOOL 0 é falso e os outros valores são verdadeiros
INT(X) valores entre -2147483648 a 214783648

# Tipos de dados DATAS

DATE: Aceita uma data no formato YYYY-MM-DD
DATETIME: Aceita uma data com horário no formato YYYY-MM-DD hh:mm:ss
TIMESTAMP: Aceita uma data no formato de DATETIME, porém apenas entre os anos 1970 a 2038
As datas também inserimos entre aspas!

# Alteração de tabelas

Adicionando colunas:
Comando: ALTER TABLE (tabela) ADDCOLUMN (nome TIPO());
exemplo: ALTER TABLE funcionarios ADD COLUMN (profissao VARCHAR(100));

Removendo colunas:
ALTER TABLE (tabela) DROP COLUMN (nome);

Alterando o tipo da coluna:
ALTER TABLE (tabela)
 MODIFY COLUMN (coluna (tipo));

# Comandos de CRUD

CRUD são ações que mais são utilizadas em todas as aplicações
Create = criar/inserir dador (insert)
Read = ler dados (select)
Update = Atualizar dados (update)
Delete = deletar/ remover dados (delete)
Toda aplicação web com banco de dados tem pelo menos uma dessas operações e possivelmente todas.

Selecionar colunas especificas

SELECT coluna1, coluna2 FROM tabela;
criando um filtro e deixando a consulta mais leve.

# Where

Where sempre deve ser inserido em update e delete

exemplo: SELECT * FROM pessoas WHERE nome = "Bob";

# Atualização de dados

UPDATE tabela SET coluna=valor WHERE condição
pode-se inserir mais colunas, separando-as por virgula
Exemplo: UPDATE pessoas SET valor = 1000 WHERE nome = "Rachel";

# Deletando dados

DELETE  FROM tabela WHERE condição
Exemplo: DELETE FROM pessoas WEHRE limite > 2000;

SELECT FORM WHERE
Exemplo: SELECT * FROM employees WHERE last_name = "Koblick";
O where pode ser específico ou agrupamento de pessoas/dados

DISTINCT seleciona apenas variações de valores
SELECT DISTINCT coluna FROM tabela;
Exemplo: SELECT DISTINCT gender FROM employees;

Operadores lógicos
AND (Recebe duas condições), volta o que atende a duas
OR Recebe duas condições volta o que atende a pelo menos 1
NOT Inverte uma clausula
Exemplo: WHERE id> 10 OR salario > 5000

AND
Exemplo: SELECT * FROM salaries WHERE salary > 100000 AND from_date > "1991-06-10";
Exemplo: SELECT * FROM salaries WHERE salary > 100000 AND from_date > "1991-06-10" AND emp_no > 10800 AND to_date > "2000-01-01";

OR 
Exemplo: WHERE salario > 5000 || profissao = "Programador";
Exemplo: SELECT * FROM titles WHERE title = "Senior Engineer" || title = "Staff";
Exemplo: SELECT * FROM titles WHERE title = "Senior Engineer" || title = "Staff" || emp_no > 12500 ORDER BY emp_no DESC;

NOT
Exemplo: WHERE NOT profissao = "programador";
Exemplo: SELECT * FROM titles WHERE NOT title = "Staff" AND NOT title = "Senior Engineer";

ORDER BY é uma isntrução de ordenação, ASC ou DESC;
Exemplo: ORDER BY salario ASC;

LIMIT - Limitando a quantidade de linhas da consulta

Exemplo: SELECT * FROM salaries ORDER BY salary LIMIT 10;
Exemplo: SELECT * FROM employees ORDER BY birth_date LIMIT 10;

# FUNÇÕES NO SQL

Função MIN - Retorna menor valor da função
SELECT MIN coluna FROM tabela;
Exemplo: SELECT MIN(salary) FROM salaries;

Função MAX - Retorna o Maior valor da coluna
SELECT MAX(coluna) FROM tabela;

Função COUNT - Faz a contagem da quantidade de registros em uma query com a delimitação
Exemplo: SELECT COUNT(*) FROM salaries WHERE salary > 100000;
Exemplo: SELECT COUNT(*) FROM employees WHERE gender = "F";
Exemplo: SELECT COUNT(*) AS "Quantidade" FROM departments;

Função AVG

Retorna Média da coluna
SELECT AVG(salary) FROM salaries;
Exemplo: SELECT AVG(salary) AS "Média" FROM salaries;
Exemplo: SELECT AVG(salary) AS "Média" FROM salaries WHERE salary > 100000;

Função SUM

Retorna a soma de todos os valores numericos de uma coluna
SELECT SUM(salary) FROM salaries;
Exemplo: SELECT SUM(salary) AS "Somatorio" FROM salaries;

Função LIKE

É utilizado sempre em conjunto com o WHERE
Serve para filtrar ainda mais os resultados
Utiliza também o coringa% que ajuda muito nas buscas;
Exemplo: SELECT * FROM employees WHERE first_name LIKE "%ber%";
Assim, teremos todos os nomes que contém ber
Exemplo: SELECT * FROM employees WHERE first_name LIKE "%ber%" AND gender = "F";
Exemplo: SELECT * FROM titles WHERE title LIKE "%Engineer";

Função IN

Vai fazer uma busca por um conjunto de valores;
Exemplo: SELECT * FROM dept_emp WHERE dept_no IN ("d004", "d005", "d006");
Desta forma selecionamos os registros apenas dos departamentos d004, d005 e d006.
Exemplo: SELECT * FROM departments WHERE dept_name IN ("Development", "Marketing");
Exemplo: SELECT * FROM dept_manager WHERE dept_no IN ("d005", "d001");
Exemplo: SELECT * FROM employees WHERE last_name IN ("Facello", "Peac");

Função BETWEEN

É parecido com o IN, mas ele recebe uma faixa de valores
Exemplo: SELECT * FROM dept_emp WHERE dept_no BETWEEN "d001" AND "d008";

Exemplo: SELECT * FROM dept_emp WHERE dept_no BETWEEN "d003" AND "d005" ORDER BY dept_no DESC;
EXEMPLO: SELECT * FROM salaries WHERE salary BETWEEN 125000 AND 175000;
Exemplo: SELECT * FROM salaries WHERE salary BETWEEN 125000 AND 175000 ORDER BY salary DESC;

# Constraints

NOT NULL força um valor de uma coluna especifica não ser nulo;
colocamos a instrução após o nome e tipo da coluna ser declarado:
nome TIPO NOT NULL;

# JOINS

INNER JOIN:
Colunas que fazem relação entre as tabelas
Podemos utilizar qual coluna resgatar após a instrução SELECT
Utilizamos a isntrução ON para determinar as colunas que precisam ser iguais
Exemplo:
SELECT employees.first_name, employees.last_name, salaries.salary
FROM employees
INNER JOIN salaries
ON employees.emp_no = salaries.emp_no;

Exemplo:
SELECT employees.first_name, employees.last_name, salaries.salary AS salario
FROM employees
INNER JOIN salaries
ON employees.emp_no = salaries.emp_no
WHERE salaries.salary >= 120000
ORDER BY salaries.salary DESC;

Exemplo:
SELECT employees.first_name, employees.gender, titles.title
FROM employees
INNER JOIN titles
ON employees.emp_no = titles.emp_no;

Left Join

Left Join vai retornar todo os dados da tabela da esquerda e os necessários da direita
também é chamado de LEFT OUTER JOIN

Exemplo:
SELECT pessoas.nome, enderecos.*
FROM pessoas
LEFT JOIN enderecos
ON pessoas.id = enderecos.pessoas_id;

Exemplo:
SELECT employees.first_name, employees.last_name, salaries.salary AS salario
FROM employees
LEFT JOIN salaries
ON employees.emp_no = salaries.emp_no;

Right Join

É semelhante ao Left, mas pegando as colunas mais a direita

Join com mais de duas tabelas

Exemplo:
SELECT employees.first_name, salaries.salary, titles.title
FROM employees
INNER JOIN salaries
ON employees.emp_no = salaries.emp_no
INNER JOIN titles
ON employees.emp_no = titles.emp_no;

Exemplo:
SELECT employees.first_name, salaries.salary, titles.title
FROM employees
INNER JOIN salaries
ON employees.emp_no = salaries.emp_no
INNER JOIN titles
ON employees.emp_no = titles.emp_no
WHERE salaries.salary > 125000
ORDER BY salaries.salary DESC;